In [1]:
import pandas as pd
import sqlite3
import seaborn as sns

In [2]:
df_reg = pd.read_csv ('Region.csv')
df_nodes = pd.read_csv ('Customernodes.csv')
df_trans = pd.read_csv ('Customertransactions.csv')

In [3]:
### """DROP TABLE Unnamed: 2;"""
conn = sqlite3.connect('DannysDiner')
c = conn.cursor()

In [4]:
df_reg.columns

Index(['  (region_id', ' region_name)', 'Unnamed: 2'], dtype='object')

In [5]:
df_nodes.columns

Index(['  ('customer_id'', ' 'region_id'', ' 'node_id'', ' 'start_date'',
       ' 'end_date')', 'Unnamed: 5'],
      dtype='object')

In [6]:
df_trans.columns

Index(['  ('customer_id'', ' 'txn_date'', ' 'txn_type'', ' 'txn_amount')',
       'Unnamed: 4'],
      dtype='object')

In [9]:
df_reg.to_sql('df_reg', conn,if_exists='replace',index=False)
df_reg.to_sql('df_nodes', conn,if_exists='replace',index=False)
df_reg.to_sql('df_trans', conn,if_exists='replace',index=False)

/Users/olasunkanmifatungase/opt/anaconda3/lib/python3.8/site-packages/pandas/core/generic.py:2872: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  sql.to_sql(

In [10]:
df_reg.head()

    (region_id   region_name)  Unnamed: 2
0         ('1'   'Australia')         NaN
1         ('2'     'America')         NaN
2         ('3'      'Africa')         NaN
3         ('4'        'Asia')         NaN
4         ('5'     'Europe');         NaN

In [ ]:
"""region_id INTEGER,
  region_name VARCHAR(9)"""

'region_id INTEGER,\n  region_name VARCHAR(9)'

In [ ]:
"""customer_id INTEGER,
  region_id INTEGER,
  node_id INTEGER,
  start_date DATE,
  end_date DATE
);"""

'customer_id INTEGER,\n  region_id INTEGER,\n  node_id INTEGER,\n  start_date DATE,\n  end_date DATE\n);'

In [ ]:
"""customer_id INTEGER,
  txn_date DATE,
  txn_type VARCHAR(10),
  txn_amount INTEGER"""

'customer_id INTEGER,\n  txn_date DATE,\n  txn_type VARCHAR(10),\n  txn_amount INTEGER'

In [ ]:
# What is the total amount each customer spent at the restaurant?

qry = """SELECT
  	product_id,
    product_name,
    price
FROM 
ORDER BY price DESC
LIMIT 5;"""

pd.read_sql_query(qry, conn)